In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 1.30469882, -0.29272197,  0.14476658],
       [-0.12950013, -0.94882842, -1.06536803],
       [-1.00284812, -1.30782866,  0.56635254],
       [-0.82160775, -1.30891004,  0.06321297]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  1.304699 -0.292722  0.144767
1 -0.129500 -0.948828 -1.065368
2 -1.002848 -1.307829  0.566353
3 -0.821608 -1.308910  0.063213

In [7]:
newDF = pd.DataFrame(data, index = ["Ali", "Ayşe"," Fatma", "Yusuf"], columns = ["Salary", "Age", "Seniority"])

In [8]:
newDF

          Salary       Age  Seniority
Ali     1.304699 -0.292722   0.144767
Ayşe   -0.129500 -0.948828  -1.065368
 Fatma -1.002848 -1.307829   0.566353
Yusuf  -0.821608 -1.308910   0.063213

In [9]:
type(newDF
    )

pandas.core.frame.DataFrame

In [11]:
newDF[["Age"
    ,"Salary"]]

             Age    Salary
Ali    -0.292722  1.304699
Ayşe   -0.948828 -0.129500
 Fatma -1.307829 -1.002848
Yusuf  -1.308910 -0.821608

In [12]:
newDF.iloc[0]

Salary       1.304699
Age         -0.292722
Seniority    0.144767
Name: Ali, dtype: float64

In [14]:
newDF.iloc[:,0]

Ali       1.304699
Ayşe     -0.129500
 Fatma   -1.002848
Yusuf    -0.821608
Name: Salary, dtype: float64

In [15]:
newDF["Extra"] = 0

In [16]:
newDF

          Salary       Age  Seniority  Extra
Ali     1.304699 -0.292722   0.144767      0
Ayşe   -0.129500 -0.948828  -1.065368      0
 Fatma -1.002848 -1.307829   0.566353      0
Yusuf  -0.821608 -1.308910   0.063213      0

In [19]:
newDF.drop("Extra", axis=1)

          Salary       Age  Seniority
Ali     1.304699 -0.292722   0.144767
Ayşe   -0.129500 -0.948828  -1.065368
 Fatma -1.002848 -1.307829   0.566353
Yusuf  -0.821608 -1.308910   0.063213

In [21]:
newDF

          Salary       Age  Seniority  Extra
Ali     1.304699 -0.292722   0.144767      0
Ayşe   -0.129500 -0.948828  -1.065368      0
 Fatma -1.002848 -1.307829   0.566353      0
Yusuf  -0.821608 -1.308910   0.063213      0

In [22]:
newDF.drop("Extra", axis=1, inplace = True)

In [23]:
newDF

          Salary       Age  Seniority
Ali     1.304699 -0.292722   0.144767
Ayşe   -0.129500 -0.948828  -1.065368
 Fatma -1.002848 -1.307829   0.566353
Yusuf  -0.821608 -1.308910   0.063213

In [24]:
newDF.drop("Yusuf")

          Salary       Age  Seniority
Ali     1.304699 -0.292722   0.144767
Ayşe   -0.129500 -0.948828  -1.065368
 Fatma -1.002848 -1.307829   0.566353

In [25]:
newDF

          Salary       Age  Seniority
Ali     1.304699 -0.292722   0.144767
Ayşe   -0.129500 -0.948828  -1.065368
 Fatma -1.002848 -1.307829   0.566353
Yusuf  -0.821608 -1.308910   0.063213

In [29]:
newDF.loc["Ali","Salary"]

np.float64(1.3046988175014134)

In [30]:
newDF.loc["Ali","Salary"] = 10

In [31]:
newDF

           Salary       Age  Seniority
Ali     10.000000 -0.292722   0.144767
Ayşe    -0.129500 -0.948828  -1.065368
 Fatma  -1.002848 -1.307829   0.566353
Yusuf   -0.821608 -1.308910   0.063213

In [32]:
newDF[newDF > 0]

        Salary  Age  Seniority
Ali       10.0  NaN   0.144767
Ayşe       NaN  NaN        NaN
 Fatma     NaN  NaN   0.566353
Yusuf      NaN  NaN   0.063213

In [34]:
newDF[newDF["Salary"]>0]

     Salary       Age  Seniority
Ali    10.0 -0.292722   0.144767

In [35]:
newDF.reset_index()

    index     Salary       Age  Seniority
0     Ali  10.000000 -0.292722   0.144767
1    Ayşe  -0.129500 -0.948828  -1.065368
2   Fatma  -1.002848 -1.307829   0.566353
3   Yusuf  -0.821608 -1.308910   0.063213

In [36]:
newDF

           Salary       Age  Seniority
Ali     10.000000 -0.292722   0.144767
Ayşe    -0.129500 -0.948828  -1.065368
 Fatma  -1.002848 -1.307829   0.566353
Yusuf   -0.821608 -1.308910   0.063213

In [37]:
resetFrame = newDF.reset_index()

In [38]:
resetFrame

    index     Salary       Age  Seniority
0     Ali  10.000000 -0.292722   0.144767
1    Ayşe  -0.129500 -0.948828  -1.065368
2   Fatma  -1.002848 -1.307829   0.566353
3   Yusuf  -0.821608 -1.308910   0.063213

In [39]:
resetFrame.loc[0]

index             Ali
Salary           10.0
Age         -0.292722
Seniority    0.144767
Name: 0, dtype: object

In [40]:
resetFrame.iloc[0]

index             Ali
Salary           10.0
Age         -0.292722
Seniority    0.144767
Name: 0, dtype: object

In [41]:
new_index = ["A", "B", "C", "D"]

In [48]:
newDF["NewIndex"] = new_index

In [49]:
newDF

           Salary       Age  Seniority New Index NewIndex
Ali     10.000000 -0.292722   0.144767         A        A
Ayşe    -0.129500 -0.948828  -1.065368         B        B
 Fatma  -1.002848 -1.307829   0.566353         C        C
Yusuf   -0.821608 -1.308910   0.063213         D        D

In [52]:
newDF.set_index("NewIndex",inplace=True)

In [53]:
newDF

             Salary       Age  Seniority New Index
NewIndex
A         10.000000 -0.292722   0.144767         A
B         -0.129500 -0.948828  -1.065368         B
C         -1.002848 -1.307829   0.566353         C
D         -0.821608 -1.308910   0.063213         D

In [54]:
newDF.loc["A"]

Salary           10.0
Age         -0.292722
Seniority    0.144767
New Index           A
Name: A, dtype: object